import { Elysia } from 'elysia';
import { cors } from '@elysiajs/cors';
import { projectController } from './core';
import { transormResponse } from './common';

const app = new Elysia({ prefix: '/api' })
  .use(cors())
  .onAfterHandle(transormResponse)
  .onError(({ error }) => {
    console.error(error);
  })
  .use(projectController)
  .listen(48327);

console.log(`
   ███████╗██╗  ██╗   ██╗███████╗██╗ █████╗ 
   ██╔════╝██║  ╚██╗ ██╔╝██╔════╝██║██╔══██╗
   █████╗  ██║   ╚████╔╝ ███████╗██║███████║
   ██╔══╝  ██║    ╚██╔╝  ╚════██║██║██╔══██║
   ███████╗███████╗██║   ███████║██║██║  ██║
   ╚══════╝╚══════╝╚═╝   ╚══════╝╚═╝╚═╝  ╚═╝

      ⚡ Elysia Server Ready on ${app.server?.port} ✔
`);
